# =========================================================
# 設定
# =========================================================

# ログファイルパス
LOG_PATH = "./2026-09-04_test_clip.log"

# 抽出対象キーワード
KEYWORD = "クリップ"

# yt-dlpでCookieを取得するブラウザ
BROWSER = "chrome"

# 使用するブラウザプロファイル
BROWSER_PROFILE = "Default"

# 取得する切り抜き開始時間
CLIP_FRONT_TIME = 30

# 取得する切り抜き終了時間
CLIP_REAR_TIME = 15

# =========================================================
# データベース設定
# =========================================================

# SQLiteデータベースファイル
DB_PATH = "./clipmaker.db"
